ahtn/keyplus/ports/efm8/efm8/mcu/C8051F360/inc/SI_C8051F360_Register_Enums.h
#define CCH0CN_CHRETI__BMASK                0x08 ///< Cache RETI Destination Enable                     
#define CCH0CN_CHRETI__SHIFT                0x03 ///< Cache RETI Destination Enable                     
#define CCH0CN_CHRETI__DISABLED             0x00 ///< Destinations of RETI instructions will not be     
                                                 ///< cached.                                           
#define CCH0CN_CHRETI__ENABLED              0x08 ///< RETI destinations will be cached.                 
                                                                                                        
#define CCH0CN_CHFLSH__BMASK                0x10 ///< Cache Flush                                       
#define CCH0CN_CHFLSH__SHIFT                0x04 ///< Cache Flush                                       
#define CCH0CN_CHFLSH__DO_NOT_FLUSH         0x00 ///< Do not flush the cache.                           
#define CCH0CN_CHFLSH__FLUSH                0x10 ///< Flush the cache.                                  
                                                                                                        
#define CCH0CN_CHPFEN__BMASK                0x20 ///< Cache Prefetch Enable                             
#define CCH0CN_CHPFEN__SHIFT                0x05 ///< Cache Prefetch Enable                             
#define CCH0CN_CHPFEN__PREFETCH_DISABLED    0x00 ///< Disable the prefetch engine.                      
#define CCH0CN_CHPFEN__PREFETCH_ENABLED     0x20 ///< Enable the prefetch engine.                       
                                                                                                        
#define CCH0CN_CHRDEN__BMASK                0x40 ///< Cache Read Enable                                 
#define CCH0CN_CHRDEN__SHIFT                0x06 ///< Cache Read Enable                                 
#define CCH0CN_CHRDEN__READ_DISABLED        0x00 ///< All instruction data comes from Flash memory or   
                                                 ///< the prefetch engine.                              
#define CCH0CN_CHRDEN__READ_ENABLED         0x40 ///< Instruction data is obtained from cache (when     
                                                 ///< available).                                       
                                                                                                        
#define CCH0CN_CHWREN__BMASK                0x80 ///< Cache Write Enable                                
#define CCH0CN_CHWREN__SHIFT                0x07 ///< Cache Write Enable                                
#define CCH0CN_CHWREN__WRITE_DISABLED       0x00 ///< Cache contents are not allowed to change, except  
                                                 ///< during flash writes/erasures or cache locks.      
#define CCH0CN_CHWREN__WRITE_ENABLED        0x80 ///< Writes to cache memory are allowed.               
                                                                                                        
//------------------------------------------------------------------------------
// CCH0LC Enums (Cache Lock Control @ 0xD2)
//------------------------------------------------------------------------------
#define CCH0LC_CHSLOT__FMASK    0x1F ///< Cache Slot Pointer                               
#define CCH0LC_CHSLOT__SHIFT    0x00 ///< Cache Slot Pointer                               
                                                                                           
#define CCH0LC_CHPOP__BMASK     0x40 ///< Cache Pop                                        
#define CCH0LC_CHPOP__SHIFT     0x06 ///< Cache Pop                                        
#define CCH0LC_CHPOP__NOT_SET   0x00 ///< Do not increment CHSLOT.                         
#define CCH0LC_CHPOP__SET       0x40 ///< Increment CHSLOT and unlock that location.       
                                                                                           
#define CCH0LC_CHPUSH__BMASK    0x80 ///< Cache Push Enable                                
#define CCH0LC_CHPUSH__SHIFT    0x07 ///< Cache Push Enable                                
#define CCH0LC_CHPUSH__DISABLED 0x00 ///< Disable cache push operations.                   
#define CCH0LC_CHPUSH__ENABLED  0x80 ///< Enable cache push operations. When a MOVC read is
                                     ///< executed, the requested 4-byte segment containing
                                     ///< the data is locked into the cache at the location
                                     ///< indicated by CHSLOT, and CHSLOT is decremented.  
                                                                                           
//------------------------------------------------------------------------------
// CCH0MA Enums (Cache Miss Accumulator @ 0xD3)
//------------------------------------------------------------------------------
#define CCH0MA_CHMSCTH__FMASK      0x7F ///< Cache Miss Penalty Accumulator               
#define CCH0MA_CHMSCTH__SHIFT      0x00 ///< Cache Miss Penalty Accumulator               
                                                                                          
#define CCH0MA_CHMSOV__BMASK       0x80 ///< Cache Miss Penalty Overflow                  
#define CCH0MA_CHMSOV__SHIFT       0x07 ///< Cache Miss Penalty Overflow                  
#define CCH0MA_CHMSOV__NO_OVERFLOW 0x00 ///< The cache miss penalty accumulator has not   
                                        ///< overflowed since it was last written.        
#define CCH0MA_CHMSOV__OVERFLOW    0x80 ///< The cache miss penalty accumulator overflowed
                                        ///< since it was last written.                   
                                                                                          
//------------------------------------------------------------------------------
// CCH0TN Enums (Cache Tuning @ 0xC9)
//------------------------------------------------------------------------------
#define CCH0TN_CHMSTH__FMASK         0x03 ///< Cache Miss Penalty Threshold                      
#define CCH0TN_CHMSTH__SHIFT         0x00 ///< Cache Miss Penalty Threshold                      
#define CCH0TN_CHMSTH__0_CLOCKS      0x00 ///< Data that takes longer than 0 clocks to obtain    
                                          ///< will be cached.                                   
#define CCH0TN_CHMSTH__1_CLOCK       0x01 ///< Data that takes longer than 1 clock to obtain will
                                          ///< be cached.                                        
#define CCH0TN_CHMSTH__2_CLOCKS      0x02 ///< Data that takes longer than 2 clocks to obtain    
                                          ///< will be cached.                                   
#define CCH0TN_CHMSTH__3_CLOCKS      0x03 ///< Data that takes longer than 3 clocks to obtain    
                                          ///< will be cached.                                   
                                                                                                 
#define CCH0TN_CHFIXM__BMASK         0x04 ///< Cache Fix MOVC Enable                             
#define CCH0TN_CHFIXM__SHIFT         0x02 ///< Cache Fix MOVC Enable                             
#define CCH0TN_CHFIXM__USE_ALGORITHM 0x00 ///< MOVC data is written according to the current     
                                          ///< algorithm selected by the CHALGM bit.             
#define CCH0TN_CHFIXM__ALWAYS_SLOT_0 0x04 ///< MOVC data is always written to cache slot 0.      
                                                                                                 
#define CCH0TN_CHALGM__BMASK         0x08 ///< Cache Algorithm Select                            
#define CCH0TN_CHALGM__SHIFT         0x03 ///< Cache Algorithm Select                            
#define CCH0TN_CHALGM__REBOUND       0x00 ///< Cache uses Rebound algorithm.                     
#define CCH0TN_CHALGM__PSEUDO_RANDOM 0x08 ///< Cache uses Pseudo-random algorithm.               
                                                                                                 
#define CCH0TN_CHMSCTL__FMASK        0xF0 ///< Cache Miss Penalty Accumulator                    
#define CCH0TN_CHMSCTL__SHIFT        0x04 ///< Cache Miss Penalty Accumulator                    
                                                                                                 
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
