ahtn/keyplus/ports/efm8/efm8/mcu/C8051F360/inc/SI_C8051F360_Register_Enums.h
#define IP_PT1__BMASK   0x08 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__SHIFT   0x03 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__LOW     0x00 ///< Timer 1 interrupt set to low priority level.                 
#define IP_PT1__HIGH    0x08 ///< Timer 1 interrupt set to high priority level.                
                                                                                               
#define IP_PS0__BMASK   0x10 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__SHIFT   0x04 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__LOW     0x00 ///< UART0 interrupt set to low priority level.                   
#define IP_PS0__HIGH    0x10 ///< UART0 interrupt set to high priority level.                  
                                                                                               
#define IP_PT2__BMASK   0x20 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__SHIFT   0x05 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__LOW     0x00 ///< Timer 2 interrupt set to low priority level.                 
#define IP_PT2__HIGH    0x20 ///< Timer 2 interrupt set to high priority level.                
                                                                                               
#define IP_PSPI0__BMASK 0x40 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__SHIFT 0x06 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__LOW   0x00 ///< SPI0 interrupt set to low priority level.                    
#define IP_PSPI0__HIGH  0x40 ///< SPI0 interrupt set to high priority level.                   
                                                                                               
//------------------------------------------------------------------------------
// OSCLCN Enums (Internal Low Frequency Oscillator Control @ 0xAD)
//------------------------------------------------------------------------------
#define OSCLCN_OSCLD__FMASK       0x03 ///< Divider Select                                   
#define OSCLCN_OSCLD__SHIFT       0x00 ///< Divider Select                                   
#define OSCLCN_OSCLD__LFOSC_DIV_8 0x00 ///< Divide by 8 selected.                            
#define OSCLCN_OSCLD__LFOSC_DIV_4 0x01 ///< Divide by 4 selected.                            
#define OSCLCN_OSCLD__LFOSC_DIV_2 0x02 ///< Divide by 2 selected.                            
#define OSCLCN_OSCLD__LFOSC_DIV_1 0x03 ///< Divide by 1 selected.                            
                                                                                             
#define OSCLCN_OSCLF__FMASK       0x3C ///< Frequency Control Value                          
#define OSCLCN_OSCLF__SHIFT       0x02 ///< Frequency Control Value                          
                                                                                             
#define OSCLCN_OSCLRDY__BMASK     0x40 ///< Oscillator Ready Flag                            
#define OSCLCN_OSCLRDY__SHIFT     0x06 ///< Oscillator Ready Flag                            
#define OSCLCN_OSCLRDY__NOT_SET   0x00 ///< Low Frequency Oscillator frequency is not stable.
#define OSCLCN_OSCLRDY__SET       0x40 ///< Low Frequency Oscillator frequency is stable.    
                                                                                             
#define OSCLCN_OSCLEN__BMASK      0x80 ///< Oscillator Enable                                
#define OSCLCN_OSCLEN__SHIFT      0x07 ///< Oscillator Enable                                
#define OSCLCN_OSCLEN__DISABLED   0x00 ///< Disable the Low Frequency Oscillator.            
#define OSCLCN_OSCLEN__ENABLED    0x80 ///< Enable the Low Frequency Oscillator.             
                                                                                             
//------------------------------------------------------------------------------
// MAC0ACC0 Enums (Accumulator Byte 0 @ 0xD2)
//------------------------------------------------------------------------------
#define MAC0ACC0_MAC0ACC0__FMASK 0xFF ///< MAC0 Accumulator Byte 0
#define MAC0ACC0_MAC0ACC0__SHIFT 0x00 ///< MAC0 Accumulator Byte 0
                                                                  
//------------------------------------------------------------------------------
// MAC0ACC1 Enums (Accumulator Byte 1 @ 0xD3)
//------------------------------------------------------------------------------
#define MAC0ACC1_MAC0ACC1__FMASK 0xFF ///< MAC0 Accumulator Byte 1
#define MAC0ACC1_MAC0ACC1__SHIFT 0x00 ///< MAC0 Accumulator Byte 1
                                                                  
//------------------------------------------------------------------------------
// MAC0ACC2 Enums (Accumulator Byte 2 @ 0xD4)
//------------------------------------------------------------------------------
#define MAC0ACC2_MAC0ACC2__FMASK 0xFF ///< MAC0 Accumulator Byte 2
#define MAC0ACC2_MAC0ACC2__SHIFT 0x00 ///< MAC0 Accumulator Byte 2
                                                                  
//------------------------------------------------------------------------------
// MAC0ACC3 Enums (Accumulator Byte 3 @ 0xD5)
//------------------------------------------------------------------------------
#define MAC0ACC3_MAC0ACC3__FMASK 0xFF ///< MAC0 Accumulator Byte 3
#define MAC0ACC3_MAC0ACC3__SHIFT 0x00 ///< MAC0 Accumulator Byte 3
                                                                  
//------------------------------------------------------------------------------
// MAC0AH Enums (Operand A High Byte @ 0xA5)
//------------------------------------------------------------------------------
#define MAC0AH_MAC0AH__FMASK 0xFF ///< MAC0 A High Byte
#define MAC0AH_MAC0AH__SHIFT 0x00 ///< MAC0 A High Byte
                                                       
//------------------------------------------------------------------------------
// MAC0AL Enums (Operand A Low Byte @ 0xA4)
//------------------------------------------------------------------------------
#define MAC0AL_MAC0AL__FMASK 0xFF ///< MAC0 A Low Byte
#define MAC0AL_MAC0AL__SHIFT 0x00 ///< MAC0 A Low Byte
                                                      
//------------------------------------------------------------------------------
// MAC0BH Enums (Operand B High Byte @ 0xF2)
//------------------------------------------------------------------------------
#define MAC0BH_MAC0BH__FMASK 0xFF ///< MAC0 B High Byte
#define MAC0BH_MAC0BH__SHIFT 0x00 ///< MAC0 B High Byte
                                                       
//------------------------------------------------------------------------------
// MAC0BL Enums (Operand B Low Byte @ 0xF1)
//------------------------------------------------------------------------------
#define MAC0BL_MAC0BL__FMASK 0xFF ///< MAC0 B Low Byte
#define MAC0BL_MAC0BL__SHIFT 0x00 ///< MAC0 B Low Byte
                                                      
//------------------------------------------------------------------------------
// MAC0CF Enums (MAC0 Configuration @ 0xD7)
//------------------------------------------------------------------------------
#define MAC0CF_ACCMD__BMASK       0x01 ///< Accumulate Mode                                 
#define MAC0CF_ACCMD__SHIFT       0x00 ///< Accumulate Mode                                 
#define MAC0CF_ACCMD__MAC_MODE    0x00 ///< Select multiply-and-accumulate (MAC) mode.      
#define MAC0CF_ACCMD__MUL_MODE    0x01 ///< Select multiply-only mode.                      
                                                                                            
#define MAC0CF_FRACMD__BMASK      0x02 ///< Fractional Mode                                 
#define MAC0CF_FRACMD__SHIFT      0x01 ///< Fractional Mode                                 
#define MAC0CF_FRACMD__INT_MODE   0x00 ///< MAC0 operates in Integer Mode.                  
#define MAC0CF_FRACMD__FRAC_MODE  0x02 ///< MAC0 operates in Fractional Mode.               
                                                                                            
#define MAC0CF_SATURATE__BMASK    0x04 ///< Saturation Enable                               
#define MAC0CF_SATURATE__SHIFT    0x02 ///< Saturation Enable                               
#define MAC0CF_SATURATE__DISABLED 0x00 ///< Rounded result will not saturate.               
#define MAC0CF_SATURATE__ENABLED  0x04 ///< Rounded result will saturate.                   
                                                                                            
#define MAC0CF_CLRACC__BMASK      0x08 ///< Clear Accumulator                               
#define MAC0CF_CLRACC__SHIFT      0x03 ///< Clear Accumulator                               
#define MAC0CF_CLRACC__COMPLETED  0x00 ///< The accumulator clear operation completed.      
#define MAC0CF_CLRACC__START      0x08 ///< Clear the accumulator and the related MAC0STA   
                                       ///< register flags.                                 
                                                                                            
