ahtn/keyplus/ports/efm8/efm8/mcu/C8051F360/inc/SI_C8051F360_Register_Enums.h
#define MAC0CF_SHIFTDIR__BMASK    0x10 ///< Accumulator Shift Direction                     
#define MAC0CF_SHIFTDIR__SHIFT    0x04 ///< Accumulator Shift Direction                     
#define MAC0CF_SHIFTDIR__LEFT     0x00 ///< The MAC0 accumulator will be shifted left.      
#define MAC0CF_SHIFTDIR__RIGHT    0x10 ///< The MAC0 accumulator will be shifted right.     
                                                                                            
#define MAC0CF_SHIFTEN__BMASK     0x20 ///< Accumulator Shift Control                       
#define MAC0CF_SHIFTEN__SHIFT     0x05 ///< Accumulator Shift Control                       
#define MAC0CF_SHIFTEN__COMPLETED 0x00 ///< The shift operation completed.                  
#define MAC0CF_SHIFTEN__START     0x20 ///< Shift the accumulator by one bit in the SHIFTDIR
                                       ///< direction.                                      
                                                                                            
//------------------------------------------------------------------------------
// MAC0OVR Enums (Accumulator Overflow Byte @ 0xD6)
//------------------------------------------------------------------------------
#define MAC0OVR_MAC0OVF__FMASK 0xFF ///< MAC0 Accumulator Overflow Byte
#define MAC0OVR_MAC0OVF__SHIFT 0x00 ///< MAC0 Accumulator Overflow Byte
                                                                       
//------------------------------------------------------------------------------
// MAC0RNDH Enums (Rounded Result High Byte @ 0xAF)
//------------------------------------------------------------------------------
#define MAC0RNDH_MAC0RND__FMASK 0xFF ///< Rounded Result High
#define MAC0RNDH_MAC0RND__SHIFT 0x00 ///< Rounded Result High
                                                             
//------------------------------------------------------------------------------
// MAC0RNDL Enums (Rounded Result Low Byte @ 0xAE)
//------------------------------------------------------------------------------
#define MAC0RNDL_MAC0RND__FMASK 0xFF ///< Rounded Result Low
#define MAC0RNDL_MAC0RND__SHIFT 0x00 ///< Rounded Result Low
                                                            
//------------------------------------------------------------------------------
// MAC0STA Enums (MAC0 Status @ 0xCF)
//------------------------------------------------------------------------------
#define MAC0STA_NEGF__BMASK    0x01 ///< Negative Flag                                
#define MAC0STA_NEGF__SHIFT    0x00 ///< Negative Flag                                
#define MAC0STA_NEGF__NOT_SET  0x00 ///< The accumulator result is zero or positive.  
#define MAC0STA_NEGF__SET      0x01 ///< The accumulator result is negative.          
                                                                                      
#define MAC0STA_SOVF__BMASK    0x02 ///< Soft Overflow Flag                           
#define MAC0STA_SOVF__SHIFT    0x01 ///< Soft Overflow Flag                           
#define MAC0STA_SOVF__NOT_SET  0x00 ///< A soft overflow did not occur.               
#define MAC0STA_SOVF__SET      0x02 ///< A soft overflow occurred.                    
                                                                                      
#define MAC0STA_ZEROF__BMASK   0x04 ///< Zero Flag                                    
#define MAC0STA_ZEROF__SHIFT   0x02 ///< Zero Flag                                    
#define MAC0STA_ZEROF__NOT_SET 0x00 ///< The last operation did not result in an      
                                    ///< accumulator value of zero.                   
#define MAC0STA_ZEROF__SET     0x04 ///< The last operation resulted in an accumulator
                                    ///< value of zero.                               
                                                                                      
#define MAC0STA_HOVF__BMASK    0x08 ///< Hard Overflow Flag                           
#define MAC0STA_HOVF__SHIFT    0x03 ///< Hard Overflow Flag                           
#define MAC0STA_HOVF__NOT_SET  0x00 ///< A hardware overflow did not occur.           
#define MAC0STA_HOVF__SET      0x08 ///< A hardware overflow occurred.                
                                                                                      
//------------------------------------------------------------------------------
// XBR0 Enums (Port I/O Crossbar 0 @ 0xE1)
//------------------------------------------------------------------------------
#define XBR0_URT0E__BMASK     0x01 ///< UART I/O Output Enable                     
#define XBR0_URT0E__SHIFT     0x00 ///< UART I/O Output Enable                     
#define XBR0_URT0E__DISABLED  0x00 ///< UART I/O unavailable at Port pin.          
#define XBR0_URT0E__ENABLED   0x01 ///< UART TX, RX routed to Port pins.           
                                                                                   
#define XBR0_SPI0E__BMASK     0x02 ///< SPI I/O Enable                             
#define XBR0_SPI0E__SHIFT     0x01 ///< SPI I/O Enable                             
#define XBR0_SPI0E__DISABLED  0x00 ///< SPI I/O unavailable at Port pins.          
#define XBR0_SPI0E__ENABLED   0x02 ///< SPI I/O routed to Port pins. The SPI can be
                                   ///< assigned either 3 or 4 GPIO pins.          
                                                                                   
#define XBR0_SMB0E__BMASK     0x04 ///< SMBus0 I/O Enable                          
#define XBR0_SMB0E__SHIFT     0x02 ///< SMBus0 I/O Enable                          
#define XBR0_SMB0E__DISABLED  0x00 ///< SMBus0 I/O unavailable at Port pins.       
#define XBR0_SMB0E__ENABLED   0x04 ///< SMBus0 I/O routed to Port pins.            
                                                                                   
#define XBR0_SYSCKE__BMASK    0x08 ///< SYSCLK Output Enable                       
#define XBR0_SYSCKE__SHIFT    0x03 ///< SYSCLK Output Enable                       
#define XBR0_SYSCKE__DISABLED 0x00 ///< SYSCLK unavailable at Port pin.            
#define XBR0_SYSCKE__ENABLED  0x08 ///< SYSCLK output routed to Port pin.          
                                                                                   
#define XBR0_CP0E__BMASK      0x10 ///< Comparator0 Output Enable                  
#define XBR0_CP0E__SHIFT      0x04 ///< Comparator0 Output Enable                  
#define XBR0_CP0E__DISABLED   0x00 ///< CP0 unavailable at Port pin.               
#define XBR0_CP0E__ENABLED    0x10 ///< CP0 routed to Port pin.                    
                                                                                   
#define XBR0_CP0AE__BMASK     0x20 ///< Comparator0 Asynchronous Output Enable     
#define XBR0_CP0AE__SHIFT     0x05 ///< Comparator0 Asynchronous Output Enable     
#define XBR0_CP0AE__DISABLED  0x00 ///< Asynchronous CP0 unavailable at Port pin.  
#define XBR0_CP0AE__ENABLED   0x20 ///< Asynchronous CP0 routed to Port pin.       
                                                                                   
