ahtn/keyplus/ports/efm8/efm8/mcu/C8051F360/inc/SI_C8051F360_Register_Enums.h
#define PCA0MD_WDTE__BMASK           0x40 ///< Watchdog Timer Enable                             
#define PCA0MD_WDTE__SHIFT           0x06 ///< Watchdog Timer Enable                             
#define PCA0MD_WDTE__DISABLED        0x00 ///< Disable Watchdog Timer.                           
#define PCA0MD_WDTE__ENABLED         0x40 ///< Enable PCA Module 5 as the Watchdog Timer.        
                                                                                                 
#define PCA0MD_CIDL__BMASK           0x80 ///< PCA Counter/Timer Idle Control                    
#define PCA0MD_CIDL__SHIFT           0x07 ///< PCA Counter/Timer Idle Control                    
#define PCA0MD_CIDL__NORMAL          0x00 ///< PCA continues to function normally while the      
                                          ///< system controller is in Idle Mode.                
#define PCA0MD_CIDL__SUSPEND         0x80 ///< PCA operation is suspended while the system       
                                          ///< controller is in Idle Mode.                       
                                                                                                 
//------------------------------------------------------------------------------
// PLL0CN Enums (PLL Control @ 0xB3)
//------------------------------------------------------------------------------
#define PLL0CN_PLLPWR__BMASK      0x01 ///< Power Enable                                    
#define PLL0CN_PLLPWR__SHIFT      0x00 ///< Power Enable                                    
#define PLL0CN_PLLPWR__DISABLED   0x00 ///< Disable the PLL bias generator. The PLL does not
                                       ///< consume any static power.                       
#define PLL0CN_PLLPWR__ENABLED    0x01 ///< Enable the PLL bias generator.                  
                                                                                            
#define PLL0CN_PLLEN__BMASK       0x02 ///< PLL Enable                                      
#define PLL0CN_PLLEN__SHIFT       0x01 ///< PLL Enable                                      
#define PLL0CN_PLLEN__DISABLED    0x00 ///< PLL is held in reset.                           
#define PLL0CN_PLLEN__ENABLED     0x02 ///< PLL is enabled.                                 
                                                                                            
#define PLL0CN_PLLSRC__BMASK      0x04 ///< Reference Clock Source Select                   
#define PLL0CN_PLLSRC__SHIFT      0x02 ///< Reference Clock Source Select                   
#define PLL0CN_PLLSRC__HFOSC      0x00 ///< PLL reference clock source is the internal High-
                                       ///< Frequency Oscillator.                           
#define PLL0CN_PLLSRC__EXTOSC     0x04 ///< PLL reference clock source is the external      
                                       ///< oscillator.                                     
                                                                                            
#define PLL0CN_PLLLCK__BMASK      0x10 ///< Lock Flag                                       
#define PLL0CN_PLLLCK__SHIFT      0x04 ///< Lock Flag                                       
#define PLL0CN_PLLLCK__NOT_LOCKED 0x00 ///< PLL output frequency is not locked.             
#define PLL0CN_PLLLCK__LOCKED     0x10 ///< PLL output frequency is locked.                 
                                                                                            
//------------------------------------------------------------------------------
// PLL0DIV Enums (PLL Divider @ 0xA9)
//------------------------------------------------------------------------------
#define PLL0DIV_PLLM__FMASK 0x1F ///< PLL Reference Clock Divider
#define PLL0DIV_PLLM__SHIFT 0x00 ///< PLL Reference Clock Divider
                                                                 
//------------------------------------------------------------------------------
// PLL0FLT Enums (PLL Filter @ 0xB2)
//------------------------------------------------------------------------------
#define PLL0FLT_PLLLP__FMASK                      0x0F ///< PLL Loop Filter Control
#define PLL0FLT_PLLLP__SHIFT                      0x00 ///< PLL Loop Filter Control
#define PLL0FLT_PLLLP__DIV_INPUT_19_TO_30_MHZ     0x01 ///< 19-30 MHz.             
#define PLL0FLT_PLLLP__DIV_INPUT_12P2_TO_19P5_MHZ 0x03 ///< 12.2-19.5 MHz.         
#define PLL0FLT_PLLLP__DIV_INPUT_7P8_TO_12P5_MHZ  0x07 ///< 7.8-12.5 MHz.          
#define PLL0FLT_PLLLP__DIV_INPUT_5_TO_8_MHZ       0x0F ///< 5-8 MHz.               
                                                                                   
#define PLL0FLT_PLLICO__FMASK                     0x30 ///< PLL Output Range       
#define PLL0FLT_PLLICO__SHIFT                     0x04 ///< PLL Output Range       
#define PLL0FLT_PLLICO__OUTPUT_65_TO_100_MHZ      0x00 ///< 65-100 MHz.            
#define PLL0FLT_PLLICO__OUTPUT_45_TO_80_MHZ       0x10 ///< 45-80 MHz.             
#define PLL0FLT_PLLICO__OUTPUT_30_TO_60_MHZ       0x20 ///< 30-60 MHz.             
#define PLL0FLT_PLLICO__OUTPUT_25_TO_50_MHZ       0x30 ///< 25-50 MHz.             
                                                                                   
//------------------------------------------------------------------------------
// PLL0MUL Enums (PLL Multiplier @ 0xB1)
//------------------------------------------------------------------------------
#define PLL0MUL_PLLN__FMASK 0xFF ///< PLL Multiplier
#define PLL0MUL_PLLN__SHIFT 0x00 ///< PLL Multiplier
                                                    
//------------------------------------------------------------------------------
// PCON Enums (Power Control @ 0x87)
//------------------------------------------------------------------------------
#define PCON_IDLE__BMASK  0x01 ///< Idle Mode Select                                
#define PCON_IDLE__SHIFT  0x00 ///< Idle Mode Select                                
#define PCON_IDLE__NORMAL 0x00 ///< Idle mode not activated.                        
#define PCON_IDLE__IDLE   0x01 ///< CPU goes into Idle mode (shuts off clock to CPU,
                               ///< but clocks to enabled peripherals are still     
                               ///< active).                                        
                                                                                    
