ahtn/keyplus/ports/efm8/efm8/mcu/C8051F360/inc/SI_C8051F360_Register_Enums.h
#define P2MASK_B3__BMASK    0x08 ///< Port 2 Bit 3 Mask Value                           
#define P2MASK_B3__SHIFT    0x03 ///< Port 2 Bit 3 Mask Value                           
#define P2MASK_B3__IGNORED  0x00 ///< P2.3 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P2MASK_B3__COMPARED 0x08 ///< P2.3 pin logic value is compared to P2MAT.3.      
                                                                                        
#define P2MASK_B4__BMASK    0x10 ///< Port 2 Bit 4 Mask Value                           
#define P2MASK_B4__SHIFT    0x04 ///< Port 2 Bit 4 Mask Value                           
#define P2MASK_B4__IGNORED  0x00 ///< P2.4 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P2MASK_B4__COMPARED 0x10 ///< P2.4 pin logic value is compared to P2MAT.4.      
                                                                                        
#define P2MASK_B5__BMASK    0x20 ///< Port 2 Bit 5 Mask Value                           
#define P2MASK_B5__SHIFT    0x05 ///< Port 2 Bit 5 Mask Value                           
#define P2MASK_B5__IGNORED  0x00 ///< P2.5 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P2MASK_B5__COMPARED 0x20 ///< P2.5 pin logic value is compared to P2MAT.5.      
                                                                                        
#define P2MASK_B6__BMASK    0x40 ///< Port 2 Bit 6 Mask Value                           
#define P2MASK_B6__SHIFT    0x06 ///< Port 2 Bit 6 Mask Value                           
#define P2MASK_B6__IGNORED  0x00 ///< P2.6 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P2MASK_B6__COMPARED 0x40 ///< P2.6 pin logic value is compared to P2MAT.6.      
                                                                                        
#define P2MASK_B7__BMASK    0x80 ///< Port 2 Bit 7 Mask Value                           
#define P2MASK_B7__SHIFT    0x07 ///< Port 2 Bit 7 Mask Value                           
#define P2MASK_B7__IGNORED  0x00 ///< P2.7 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P2MASK_B7__COMPARED 0x80 ///< P2.7 pin logic value is compared to P2MAT.7.      
                                                                                        
//------------------------------------------------------------------------------
// P2MAT Enums (Port 2 Match @ 0xB1)
//------------------------------------------------------------------------------
#define P2MAT_B0__BMASK 0x01 ///< Port 2 Bit 0 Match Value                         
#define P2MAT_B0__SHIFT 0x00 ///< Port 2 Bit 0 Match Value                         
#define P2MAT_B0__LOW   0x00 ///< P2.0 pin logic value is compared with logic LOW. 
#define P2MAT_B0__HIGH  0x01 ///< P2.0 pin logic value is compared with logic HIGH.
                                                                                   
#define P2MAT_B1__BMASK 0x02 ///< Port 2 Bit 1 Match Value                         
#define P2MAT_B1__SHIFT 0x01 ///< Port 2 Bit 1 Match Value                         
#define P2MAT_B1__LOW   0x00 ///< P2.1 pin logic value is compared with logic LOW. 
#define P2MAT_B1__HIGH  0x02 ///< P2.1 pin logic value is compared with logic HIGH.
                                                                                   
#define P2MAT_B2__BMASK 0x04 ///< Port 2 Bit 2 Match Value                         
#define P2MAT_B2__SHIFT 0x02 ///< Port 2 Bit 2 Match Value                         
#define P2MAT_B2__LOW   0x00 ///< P2.2 pin logic value is compared with logic LOW. 
#define P2MAT_B2__HIGH  0x04 ///< P2.2 pin logic value is compared with logic HIGH.
                                                                                   
#define P2MAT_B3__BMASK 0x08 ///< Port 2 Bit 3 Match Value                         
#define P2MAT_B3__SHIFT 0x03 ///< Port 2 Bit 3 Match Value                         
#define P2MAT_B3__LOW   0x00 ///< P2.3 pin logic value is compared with logic LOW. 
#define P2MAT_B3__HIGH  0x08 ///< P2.3 pin logic value is compared with logic HIGH.
                                                                                   
#define P2MAT_B4__BMASK 0x10 ///< Port 2 Bit 4 Match Value                         
#define P2MAT_B4__SHIFT 0x04 ///< Port 2 Bit 4 Match Value                         
#define P2MAT_B4__LOW   0x00 ///< P2.4 pin logic value is compared with logic LOW. 
#define P2MAT_B4__HIGH  0x10 ///< P2.4 pin logic value is compared with logic HIGH.
                                                                                   
#define P2MAT_B5__BMASK 0x20 ///< Port 2 Bit 5 Match Value                         
#define P2MAT_B5__SHIFT 0x05 ///< Port 2 Bit 5 Match Value                         
#define P2MAT_B5__LOW   0x00 ///< P2.5 pin logic value is compared with logic LOW. 
#define P2MAT_B5__HIGH  0x20 ///< P2.5 pin logic value is compared with logic HIGH.
                                                                                   
#define P2MAT_B6__BMASK 0x40 ///< Port 2 Bit 6 Match Value                         
#define P2MAT_B6__SHIFT 0x06 ///< Port 2 Bit 6 Match Value                         
#define P2MAT_B6__LOW   0x00 ///< P2.6 pin logic value is compared with logic LOW. 
#define P2MAT_B6__HIGH  0x40 ///< P2.6 pin logic value is compared with logic HIGH.
                                                                                   
#define P2MAT_B7__BMASK 0x80 ///< Port 2 Bit 7 Match Value                         
#define P2MAT_B7__SHIFT 0x07 ///< Port 2 Bit 7 Match Value                         
#define P2MAT_B7__LOW   0x00 ///< P2.7 pin logic value is compared with logic LOW. 
#define P2MAT_B7__HIGH  0x80 ///< P2.7 pin logic value is compared with logic HIGH.
                                                                                   
//------------------------------------------------------------------------------
// P2MDIN Enums (Port 2 Input Mode @ 0xF3)
//------------------------------------------------------------------------------
#define P2MDIN_B0__BMASK   0x01 ///< Port 2 Bit 0 Input Mode                 
#define P2MDIN_B0__SHIFT   0x00 ///< Port 2 Bit 0 Input Mode                 
#define P2MDIN_B0__ANALOG  0x00 ///< P2.0 pin is configured for analog mode. 
#define P2MDIN_B0__DIGITAL 0x01 ///< P2.0 pin is configured for digital mode.
                                                                             
#define P2MDIN_B1__BMASK   0x02 ///< Port 2 Bit 1 Input Mode                 
#define P2MDIN_B1__SHIFT   0x01 ///< Port 2 Bit 1 Input Mode                 
#define P2MDIN_B1__ANALOG  0x00 ///< P2.1 pin is configured for analog mode. 
#define P2MDIN_B1__DIGITAL 0x02 ///< P2.1 pin is configured for digital mode.
                                                                             
#define P2MDIN_B2__BMASK   0x04 ///< Port 2 Bit 2 Input Mode                 
#define P2MDIN_B2__SHIFT   0x02 ///< Port 2 Bit 2 Input Mode                 
#define P2MDIN_B2__ANALOG  0x00 ///< P2.2 pin is configured for analog mode. 
#define P2MDIN_B2__DIGITAL 0x04 ///< P2.2 pin is configured for digital mode.
                                                                             
#define P2MDIN_B3__BMASK   0x08 ///< Port 2 Bit 3 Input Mode                 
#define P2MDIN_B3__SHIFT   0x03 ///< Port 2 Bit 3 Input Mode                 
#define P2MDIN_B3__ANALOG  0x00 ///< P2.3 pin is configured for analog mode. 
#define P2MDIN_B3__DIGITAL 0x08 ///< P2.3 pin is configured for digital mode.
                                                                             
#define P2MDIN_B4__BMASK   0x10 ///< Port 2 Bit 4 Input Mode                 
#define P2MDIN_B4__SHIFT   0x04 ///< Port 2 Bit 4 Input Mode                 
#define P2MDIN_B4__ANALOG  0x00 ///< P2.4 pin is configured for analog mode. 
#define P2MDIN_B4__DIGITAL 0x10 ///< P2.4 pin is configured for digital mode.
                                                                             
